/*
 * IncFile1.h
 *
 * Created: 11.12.2018 22:26:45
 *  Author: Mikhail
 */
#include <util/delay.h>
 
#ifndef I2C_H_
#define I2C_H_

//настройка порта I2C
#define I2C_DDR		DDRB	/*порт управления I2C*/
#define I2C_PORT	PORTB	/*порт вывода данных на линию I2C*/
#define I2C_PIN		PINB	/*порт ввода данных с линий I2C*/
#define SDA			PORTB1	/*линия DATA*/
#define SCL			PORTB0	/*линия CLC*/
#define I2C_DELAY	_delay_us(10);	 // по умолчанию задержки 10 микросекунд

//===============================================================
//                    Инициализация порта I2C
//===============================================================
void i2c_init (void);

//===============================================================
//                    Генерация условия старт
//===============================================================
void i2c_start (void);

//===============================================================
//                   Генерация условия стоп
//===============================================================
void i2c_stop (void);

//===============================================================
//      Генерация условия рестарт
//===============================================================
void i2c_restart (void);

//===============================================================
//                    Отправка байта по I2С
//===============================================================
unsigned char i2c_send_byte (unsigned char data);

//===============================================================
//                   Считывание байта по I2C
//===============================================================
unsigned char i2c_get_byte (unsigned char last_byte);

#endif /* I2C_H_ */